In [1]:
import pandas as pd 
dataframe = pd.read_csv("titanic/train.csv")

In [3]:
dataframe.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [22]:
dataframe.describe()
#age is not enough, only 714 counted, 177 missing

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [23]:
dataframe[dataframe['Age'].isnull()].describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,177.000000,177.000000,177.000000,0.0,177.000000,177.000000,177.000000
mean,435.581921,0.293785,2.598870,NaN,0.564972,0.180791,22.158567
std,250.552901,0.456787,0.763216,NaN,1.626316,0.534145,31.874608
min,6.000000,0.000000,1.000000,NaN,0.000000,0.000000,0.000000
25%,230.000000,0.000000,3.000000,NaN,0.000000,0.000000,7.750000
50%,452.000000,0.000000,3.000000,NaN,0.000000,0.000000,8.050000
75%,634.000000,1.000000,3.000000,NaN,0.000000,0.000000,24.150000
max,889.000000,1.000000,3.000000,NaN,8.000000,2.000000,227.525000

In [27]:
dataframe.groupby(['Sex','Survived'])['PassengerId'].count()

Sex     Survived
female  0            81
        1           233
male    0           468
        1           109
Name: PassengerId, dtype: int64

In [29]:
import matplotlib.pyplot as plt
dataframe.groupby(['Sex','Survived'])['PassengerId'].count()

Sex     Survived
female  0            81
        1           233
male    0           468
        1           109
Name: PassengerId, dtype: int64

In [13]:
dataframe
#sex
#ticket
#cabin
#embarked

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [32]:
dataframe.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [56]:
def family_Size():
    global dataframe
    dataframe['FamilySize'] = dataframe['SibSp'] + dataframe['Parch'] + 1
    dataframe['Single'] = dataframe['FamilySize'].map(lambda s: 1 if s==1 else 0)
    dataframe['SmallFamily'] = dataframe['FamilySize'].map(lambda s: 1 if 2<=s<=4 else 0)
    dataframe['LargeFamily'] = dataframe['FamilySize'].map(lambda s: 1 if s>=5 else 0)
    return dataframe

In [20]:
dataframe['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [35]:
dataframe.count()

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

In [31]:
dataframe.groupby('Embarked').count()
#Almost S, we can use S to inplace the NaN

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin
Embarked,,,,,,,,,,,
C,168,168,168,168,168,130,168,168,168,168,69
Q,77,77,77,77,77,28,77,77,77,77,4
S,644,644,644,644,644,554,644,644,644,644,129

In [50]:
def embarked():
    global dataframe
    dataframe.Embarked.fillna('S',inplace=True)

    dataframe_dummies = pd.get_dummies(dataframe['Embarked'])
    print(dataframe_dummies)
    dataframe=pd.concat([dataframe,dataframe_dummies],axis=1)
    dataframe.drop('Embarked',axis=1,inplace=True)
    return dataframe

In [51]:
dataframe = embarked()

AttributeError: 'DataFrame' object has no attribute 'Embarked'

In [52]:
dataframe

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,C,Q,S
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,0,0,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,1,0,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,0,0,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,0,0,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,0,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,0,0,1
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,0,0,1
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,0,0,1
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,1,0,0
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,0,1,0

In [14]:
dataframe.shape

(891, 12)

In [15]:
dataframe.iloc[0]

PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Sex                               male
Age                                 22
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
Cabin                              NaN
Embarked                             S
Name: 0, dtype: object

In [54]:
dataframe.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare,C,Q,S
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208,0.188552,0.086420,0.725028
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429,0.391372,0.281141,0.446751
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400,0.000000,0.000000,0.000000
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200,0.000000,0.000000,1.000000
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000,0.000000,0.000000,1.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200,1.000000,1.000000,1.000000

In [55]:
dataframe.describe().C + dataframe.describe().Q + dataframe.describe().S
#Check

count    2673.000000
mean        1.000000
std         1.119264
min         0.000000
25%         0.000000
50%         1.000000
75%         1.000000
max         3.000000
dtype: float64

In [57]:
dataframe = family_Size()

In [58]:
dataframe

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,C,Q,S,FamilySize,Single,SmallFamily,LargeFamily
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,0,0,1,2,0,1,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,1,0,0,2,0,1,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,0,0,1,1,1,0,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,0,0,1,2,0,1,0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,0,0,1,1,1,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,0,0,1,1,1,0,0
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,0,0,1,1,1,0,0
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,0,0,1,4,0,1,0
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,1,0,0,1,1,0,0
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,0,1,0,1,1,0,0

In [60]:
def process_cabin():
    global dataframe
    dataframe.Cabin.fillna('U',inplace=True)
    dataframe['Cabin'] = dataframe['Cabin'].map(lambda c:c[0])
    cabin_dummies = pd.get_dummies(dataframe['Cabin'],prefix='Cabin')
    dataframe = pd.concat([dataframe,cabin_dummies],axis=1)
    dataframe.drop('Cabin',axis=1,inplace=True)
    return dataframe

In [61]:
dataframe = process_cabin()

In [62]:
dataframe

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,...,LargeFamily,Cabin_A,Cabin_B,Cabin_C,Cabin_D,Cabin_E,Cabin_F,Cabin_G,Cabin_T,Cabin_U
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,...,0,0,0,0,0,0,0,0,0,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,...,0,0,0,1,0,0,0,0,0,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,...,0,0,0,0,0,0,0,0,0,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,...,0,0,0,1,0,0,0,0,0,0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,...,0,0,0,0,0,0,0,0,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,...,0,0,0,0,0,0,0,0,0,1
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,...,0,0,1,0,0,0,0,0,0,0
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,...,0,0,0,0,0,0,0,0,0,1
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,...,0,0,0,1,0,0,0,0,0,0
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,...,0,0,0,0,0,0,0,0,0,1

In [63]:
dataframe.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare,C,Q,S,...,LargeFamily,Cabin_A,Cabin_B,Cabin_C,Cabin_D,Cabin_E,Cabin_F,Cabin_G,Cabin_T,Cabin_U
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,...,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208,0.188552,0.086420,0.725028,...,0.069585,0.016835,0.052750,0.066218,0.037037,0.035915,0.014590,0.004489,0.001122,0.771044
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429,0.391372,0.281141,0.446751,...,0.254589,0.128725,0.223659,0.248802,0.188959,0.186182,0.119973,0.066890,0.033501,0.420397
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,1.000000
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200,0.000000,0.000000,1.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,1.000000
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000,0.000000,0.000000,1.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,1.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200,1.000000,1.000000,1.000000,...,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000

In [64]:
dataframe.iloc[0]

PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Sex                               male
Age                                 22
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
C                                    0
Q                                    0
S                                    1
FamilySize                           2
Single                               0
SmallFamily                          1
LargeFamily                          0
Cabin_A                              0
Cabin_B                              0
Cabin_C                              0
Cabin_D                              0
Cabin_E                              0
Cabin_F                              0
Cabin_G                              0
Cabin_T                              0
Cabin_U                              1
Name: 0, dtype: object

In [93]:
Title_dictionary = {
    'Mr': 'Mr', 'Mrs': 'Mrs', 'Miss': 'Miss', 'Master': 'Master', 'Don': 'Royalty', 'Rev': 'Officer', 'Dr': 'Officer', 'Mme': 'Mrs', 'Ms': 'Ms', 'Major': 'Major', 'Lady': 'Royalty', 'Sir': 'Royalty', 'Mlle': 'Miss', 'Col': 'Officer', 'Capt': 'Officer', 'the Countess': 'Royalty', 'Jonkheer': 'Royalty'
}


def process_Name():
    global dataframe
    dataframe['Temp'] = dataframe['Name'].map(lambda a:a.split(',')[1].split('.')[0].strip())
    dataframe['Title'] = dataframe.Temp.map(Title_dictionary)
    return dataframe

In [77]:
dataframe.drop('Title',axis=1,inplace=True)

In [94]:
dataframe = process_Name()

In [98]:
dataframe

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,...,Cabin_B,Cabin_C,Cabin_D,Cabin_E,Cabin_F,Cabin_G,Cabin_T,Cabin_U,Temp,Title
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,...,0,0,0,0,0,0,0,1,Mr,Mr
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,...,0,1,0,0,0,0,0,0,Mrs,Mrs
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,...,0,0,0,0,0,0,0,1,Miss,Miss
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,...,0,1,0,0,0,0,0,0,Mrs,Mrs
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,...,0,0,0,0,0,0,0,1,Mr,Mr
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,...,0,0,0,0,0,0,0,1,Rev,Officer
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,...,1,0,0,0,0,0,0,0,Miss,Miss
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,...,0,0,0,0,0,0,0,1,Miss,Miss
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,...,0,1,0,0,0,0,0,0,Mr,Mr
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,...,0,0,0,0,0,0,0,1,Mr,Mr

In [96]:
titles = set()
titles_dic = {}
for name in dataframe['Name']:
    title = name.split(',')[1].split('.')[0].strip()
    titles.add(title)
    if title not in titles_dic:
        titles_dic[title] = 1
    else:
        titles_dic[title] += 1
print(titles)
print(titles_dic)

{'Master', 'Sir', 'Major', 'Jonkheer', 'Mrs', 'Dr', 'Miss', 'Capt', 'Lady', 'Mme', 'Don', 'Col', 'Ms', 'Mlle', 'Mr', 'Rev', 'the Countess'}
{'Mr': 517, 'Mrs': 125, 'Miss': 182, 'Master': 40, 'Don': 1, 'Rev': 6, 'Dr': 7, 'Mme': 1, 'Ms': 1, 'Major': 2, 'Lady': 1, 'Sir': 1, 'Mlle': 2, 'Col': 2, 'Capt': 1, 'the Countess': 1, 'Jonkheer': 1}

In [99]:
dataframe.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare,C,Q,S,...,LargeFamily,Cabin_A,Cabin_B,Cabin_C,Cabin_D,Cabin_E,Cabin_F,Cabin_G,Cabin_T,Cabin_U
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,...,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208,0.188552,0.086420,0.725028,...,0.069585,0.016835,0.052750,0.066218,0.037037,0.035915,0.014590,0.004489,0.001122,0.771044
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429,0.391372,0.281141,0.446751,...,0.254589,0.128725,0.223659,0.248802,0.188959,0.186182,0.119973,0.066890,0.033501,0.420397
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,1.000000
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200,0.000000,0.000000,1.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,1.000000
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000,0.000000,0.000000,1.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,1.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200,1.000000,1.000000,1.000000,...,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000

In [100]:
dataframe.iloc[0]

PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Sex                               male
Age                                 22
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
C                                    0
Q                                    0
S                                    1
FamilySize                           2
Single                               0
SmallFamily                          1
LargeFamily                          0
Cabin_A                              0
Cabin_B                              0
Cabin_C                              0
Cabin_D                              0
Cabin_E                              0
Cabin_F                              0
Cabin_G                              0
Cabin_T                              0
Cabin_U                              1
Temp                                Mr
Title                               Mr
Name: 0, dtype: object

In [101]:
dataframe.drop('Temp',axis=1,inplace=True)

In [102]:
dataframe.iloc[0]

PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Sex                               male
Age                                 22
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
C                                    0
Q                                    0
S                                    1
FamilySize                           2
Single                               0
SmallFamily                          1
LargeFamily                          0
Cabin_A                              0
Cabin_B                              0
Cabin_C                              0
Cabin_D                              0
Cabin_E                              0
Cabin_F                              0
Cabin_G                              0
Cabin_T                              0
Cabin_U                              1
Title                               Mr
Name: 0, dtype: object

In [106]:
grouped_train = dataframe.groupby(['Sex','Pclass','Title'])  #Take the x-axis to y-axis
grouped_median_train = grouped_train.median()  
grouped_median_train = grouped_median_train.reset_index()[['Sex','Pclass','Title','Age']]   #Return it back

In [116]:
grouped_median_train

       Sex  Pclass    Title   Age
0   female       1     Miss  30.0
1   female       1      Mrs  40.0
2   female       1  Officer  49.0
3   female       1  Royalty  40.5
4   female       2     Miss  24.0
5   female       2      Mrs  32.0
6   female       2       Ms  28.0
7   female       3     Miss  18.0
8   female       3      Mrs  31.0
9     male       1    Major  48.5
10    male       1   Master   4.0
11    male       1       Mr  40.0
12    male       1  Officer  53.0
13    male       1  Royalty  40.0
14    male       2   Master   1.0
15    male       2       Mr  31.0
16    male       2  Officer  46.5
17    male       3   Master   4.0
18    male       3       Mr  26.0

In [125]:
import numpy as np

def fill_age(row):
    condition = (
        (grouped_median_train['Sex'] == row['Sex']) & (grouped_median_train['Pclass'] == row['Pclass']) & (grouped_median_train['Title'] == row['Title'])
        )
    #print(np.isnan(grouped_median_train[condition]['Age'])
    if np.isnan(grouped_median_train[condition]['Age'].values[0]):
        print('true')
        condition = (
        (grouped_median_train['Sex'] == row['Sex']) & (grouped_median_train['Pclass'] == row['Pclass'])
        )
    return grouped_median_train[condition]['Age'].values[0]

def process_age():
    global dataframe
    dataframe['Age'] = dataframe.apply(lambda row:fill_age(row) if np.isnan(row['Age']) else row['Age'], axis=1)
    return dataframe

In [126]:
dataframe = process_age()

In [128]:
dataframe.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare,C,Q,S,...,LargeFamily,Cabin_A,Cabin_B,Cabin_C,Cabin_D,Cabin_E,Cabin_F,Cabin_G,Cabin_T,Cabin_U
count,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,...,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.140483,0.523008,0.381594,32.204208,0.188552,0.086420,0.725028,...,0.069585,0.016835,0.052750,0.066218,0.037037,0.035915,0.014590,0.004489,0.001122,0.771044
std,257.353842,0.486592,0.836071,13.498982,1.102743,0.806057,49.693429,0.391372,0.281141,0.446751,...,0.254589,0.128725,0.223659,0.248802,0.188959,0.186182,0.119973,0.066890,0.033501,0.420397
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,21.000000,0.000000,0.000000,7.910400,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,1.000000
50%,446.000000,0.000000,3.000000,26.000000,0.000000,0.000000,14.454200,0.000000,0.000000,1.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,1.000000
75%,668.500000,1.000000,3.000000,36.750000,1.000000,0.000000,31.000000,0.000000,0.000000,1.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,1.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200,1.000000,1.000000,1.000000,...,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000

In [129]:
dataframe.iloc[0]

PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Sex                               male
Age                                 22
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
C                                    0
Q                                    0
S                                    1
FamilySize                           2
Single                               0
SmallFamily                          1
LargeFamily                          0
Cabin_A                              0
Cabin_B                              0
Cabin_C                              0
Cabin_D                              0
Cabin_E                              0
Cabin_F                              0
Cabin_G                              0
Cabin_T                              0
Cabin_U                              1
Title                               Mr
Name: 0, dtype: object

In [154]:
dataframe.drop(['Ticket','Fare'],axis=1,inplace=True)
title_dummies = pd.get_dummies(dataframe['Title'],prefix='Title')
sex_dummies = pd.get_dummies(dataframe['Sex'],prefix='Sex')
dataframe = pd.concat([dataframe, title_dummies, sex_dummies], axis=1)
dataframe.drop(['Sex','Title'],axis=1,inplace=True)
dataframe.iloc[0]

KeyError: "['Ticket' 'Fare'] not found in axis"

In [157]:
from sklearn.model_selection import train_test_split
from sklearn.neighbors import KNeighborsClassifier
from sklearn.ensemble import RandomForestClassifier

data = dataframe
data_y = data.Survived
data_X = data.iloc[:,2:]
#print(data_y)
#print(data_X)
X_train,X_test,y_train,y_test=train_test_split(data_X,data_y,test_size=0.1)

m = RandomForestClassifier(n_estimators=180,min_samples_leaf=3,max_features=0.5,n_jobs=1)
m.fit(X_train,y_train)
print(m.score(X_train,y_train))


test_dataframe = pd.read_csv("titanic/test.csv")
test_dataframe['FamilySize'] = test_dataframe['SibSp'] + test_dataframe['Parch'] + 1
test_dataframe['Single'] = test_dataframe['FamilySize'].map(lambda s: 1 if s==1 else 0)
test_dataframe['SmallFamily'] = test_dataframe['FamilySize'].map(lambda s: 1 if 2<=s<=4 else 0)
test_dataframe['LargeFamily'] = test_dataframe['FamilySize'].map(lambda s: 1 if s>=5 else 0)
test_dataframe.Embarked.fillna('S',inplace=True)
test_dataframe_dummies = pd.get_dummies(test_dataframe['Embarked'])
test_dataframe=pd.concat([test_dataframe,test_dataframe_dummies],axis=1)
test_dataframe.drop('Embarked',axis=1,inplace=True)
test_dataframe.Cabin.fillna('U',inplace=True)
test_dataframe['Cabin'] = test_dataframe['Cabin'].map(lambda c:c[0])
test_cabin_dummies = pd.get_dummies(test_dataframe['Cabin'],prefix='Cabin')
test_dataframe = pd.concat([test_dataframe,test_cabin_dummies],axis=1)
test_dataframe.drop('Cabin',axis=1,inplace=True)
Title_dictionary = {
    'Mr': 'Mr', 'Mrs': 'Mrs', 'Miss': 'Miss', 'Master': 'Master', 'Don': 'Royalty', 'Rev': 'Officer', 'Dr': 'Officer', 'Mme': 'Mrs', 'Ms': 'Ms', 'Major': 'Major', 'Lady': 'Royalty', 'Sir': 'Royalty', 'Mlle': 'Miss', 'Col': 'Officer', 'Capt': 'Officer', 'the Countess': 'Royalty', 'Jonkheer': 'Royalty'
}
test_dataframe['Temp'] = test_dataframe['Name'].map(lambda a:a.split(',')[1].split('.')[0].strip())
test_dataframe['Title'] = test_dataframe.Temp.map(Title_dictionary)
test_dataframe.drop('Temp',axis=1,inplace=True)
test_dataframe.drop(['Ticket','Fare'],axis=1,inplace=True)
test_title_dummies = pd.get_dummies(test_dataframe['Title'],prefix='Title')
test_sex_dummies = pd.get_dummies(test_dataframe['Sex'],prefix='Sex')
test_dataframe = pd.concat([test_dataframe, test_title_dummies, test_sex_dummies], axis=1)

grouped_train = test_dataframe.groupby(['Sex','Pclass','Title'])  #Take the x-axis to y-axis
grouped_median_train = grouped_train.median()  
grouped_median_train = grouped_median_train.reset_index()[['Sex','Pclass','Title','Age']]   #Return it back
def fill_age(row):
    condition = (
        (grouped_median_train['Sex'] == row['Sex']) & (grouped_median_train['Pclass'] == row['Pclass']) & (grouped_median_train['Title'] == row['Title'])
    )
    if np.isnan(grouped_median_train[condition]['Age'].values[0]):
        condition = (
        (grouped_median_train['Sex'] == row['Sex']) & (grouped_median_train['Pclass'] == row['Pclass'])
        )
    return grouped_median_train[condition]['Age'].values[0]
test_dataframe['Age'] = test_dataframe.apply(lambda row:fill_age(row) if np.isnan(row['Age']) else row['Age'], axis=1)
test_dataframe.drop(['Sex','Title','Name'],axis=1,inplace=True)

#print(test_dataframe.iloc[0])
m.predict(test_dataframe)
# knn = KNeighborsClassifier()
# knn.fit(X_train,y_train)
# print(knn.predict(X_test))
# print(y_test)

0.8901373283395755

array([0, 1, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 1, 0, 1, 1, 0, 1, 1, 1, 1, 1,
       1, 1, 1, 0, 1, 1, 1, 1, 0, 0, 1, 1, 1, 1, 0, 0, 0, 0, 1, 1, 0, 1,
       1, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1,
       0, 0, 1, 1, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0,
       0, 1, 1, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 1,
       1, 0, 0, 0, 1, 1, 1, 1, 1, 1, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 1,
       1, 1, 0, 0, 1, 0, 0, 1, 1, 0, 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 1,
       1, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 1, 1, 1, 1, 0, 0, 1, 0, 1, 1, 1,
       0, 1, 1, 1, 0, 1, 1, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 1, 0, 1, 0,
       0, 1, 0, 1, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 1, 1, 0,
       1, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 1, 1, 1, 1, 1,
       1, 0, 1, 1, 1, 1, 1, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1,
       1, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 1, 1, 0,
       0, 1, 1, 0, 0, 0, 1, 1, 0, 0, 1, 1, 0, 0, 0, 1, 1, 0, 0, 1, 1, 1,
       1, 1, 0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 1, 0, 0, 0, 1, 1, 0, 0,
       1, 1, 1, 1, 0, 1, 0, 1, 0, 1, 0, 0, 1, 1, 1, 0, 0, 1, 0, 0, 1, 0,
       0, 1, 1, 1, 1, 0, 0, 1, 1, 1, 1, 0, 1, 1, 1, 0, 1, 1, 0, 0, 1, 0,
       1, 0, 0, 0, 1, 1, 0, 0, 1, 1, 0, 1, 0, 0, 0, 1, 1, 1, 1, 0, 1, 1,
       0, 1, 0, 0, 0, 0, 1, 0, 1, 1, 0, 1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 1])